Tekla Open API Reference for Tekla Structures 2025
ProfileItem.IsSketchedUserParametric Property
 Whether the profile is a parametric user-defined sketched profile.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsSketchedUserParametric { get; }
Public ReadOnly Property IsSketchedUserParametric As Boolean
	Get
Return Value
Type: Boolean
 True if the profile is a parametric user-defined sketched profile, false otherwise.
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace